---
type: StructuralSectionsServiceData
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# StructuralSectionsServiceData

`Autodesk.Revit.DB.Structure.StructuralSectionsServiceData` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCurrentElements | 2015 | `public IList < ElementId > GetCurrentElements ()` |
| Property | Document | 2015 | `public Document Document { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |